#pragma once

// Pubg Mobile (3.2.0) DUMP BY @K_Y_2 Mon May 13 11:25:04 2024
 
namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_XSuitGlideCfg_type.BP_STRUCT_XSuitGlideCfg_type
// 0x0028
struct FBP_STRUCT_XSuitGlideCfg_type
{
	int                                                GlideID_0_51AD7E8006794C3E097CF0C70EA83E24;               // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                SpecialGlideID_1_5AC10EC0763BBA1D241BCEB704EF2374;        // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                XSuitID1_2_509B90C0005572A13F0DFEAB02D9F3A1;              // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                XSuitID7_3_50A19240005572A73F0DFEA502D9F3A7;              // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<int>                                        LocationOffsetArray_a_4_0FED19C012EEAE1F38E3F00A03461BD1; // 0x0010(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<int>                                        SpecialLocationOffsetArray_a_5_2CF6EA005DD9E58211A95EF904554C11;// 0x001C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

